##Import pandas and read csv

In [11]:
import pandas as pd
df = pd.read_csv('/content/hermes_attica.txt')

In [20]:
df

         obj_id  traj_id  subtraj_id  ...        lat  episode           tags
0             0        1           1  ...  37.981186     STOP  HOME;RELAXING
1             1        1           1  ...  37.972023     STOP  HOME;RELAXING
2             2        1           1  ...  37.969555     STOP  HOME;RELAXING
3             3        1           1  ...  37.981720     STOP  HOME;RELAXING
4             4        1           1  ...  37.986094     STOP  HOME;RELAXING
...         ...      ...         ...  ...        ...      ...            ...
1450733    4987        1           5  ...  38.050924     STOP  HOME;RELAXING
1450734    4988        1           5  ...  38.046017     STOP  HOME;RELAXING
1450735    4989        1           5  ...  38.033770     STOP  HOME;RELAXING
1450736    4990        1           5  ...  38.035929     STOP  HOME;RELAXING
1450737    4992        1           5  ...  38.033770     STOP  HOME;RELAXING

[1450738 rows x 8 columns]

In [13]:
len(df)

1450738

##Manipulate Hermes Attika Spatial Dataset

In [22]:
#todo
newDF = df[['obj_id','lat', 'lon']]
newDF

         obj_id        lat        lon
0             0  37.981186  23.689793
1             1  37.972023  23.674541
2             2  37.969555  23.678286
3             3  37.981720  23.680568
4             4  37.986094  23.698814
...         ...        ...        ...
1450733    4987  38.050924  23.736674
1450734    4988  38.046017  23.735085
1450735    4989  38.033770  23.727688
1450736    4990  38.035929  23.729743
1450737    4992  38.033770  23.727688

[1450738 rows x 3 columns]

##Dataframe to CSV

In [25]:
#newDF.to_csv('/content/spatial_data_1450738.csv')

In [28]:
mpla = pd.read_csv('/content/spatial_data_1450738.csv')

In [29]:
mpla

         Unnamed: 0  obj_id        lat        lon
0                 0       0  37.981186  23.689793
1                 1       1  37.972023  23.674541
2                 2       2  37.969555  23.678286
3                 3       3  37.981720  23.680568
4                 4       4  37.986094  23.698814
...             ...     ...        ...        ...
1450733     1450733    4987  38.050924  23.736674
1450734     1450734    4988  38.046017  23.735085
1450735     1450735    4989  38.033770  23.727688
1450736     1450736    4990  38.035929  23.729743
1450737     1450737    4992  38.033770  23.727688

[1450738 rows x 4 columns]